20220512084246-having_a_job_as_a_right.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-23 Tue 22:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Having a job as a right</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Having a job as a right</h1>
<p>
I am not a fan of legalism, but it is usefully to understand what the true motivation for the <a href="20220512083110-job_guarantee.html#ID-88bbaec1-0b44-40ab-985c-40c20d8fecb0">right to a job</a> were at the time. What problem it was trying to answer and what reasons were invoked at the time.
</p>

<p>
The Preamble to the <a target='_blank' rel='noopener noreferrer' class='external' href="https://www.legifrance.gouv.fr/contenu/menu/droit-national-en-vigueur/constitution/preambule-de-la-constitution-du-27-octobre-1946">French Constitution of 1946</a> (4th Republic), which is included in the <a target='_blank' rel='noopener noreferrer' class='external' href="https://www.legifrance.gouv.fr/loda/id/JORFTEXT000000571356/2019-07-01/">French Constitution of 1958</a> (5th Republic) states in its 5th article:
</p>

<blockquote>
<p>
Chacun a le devoir de travailler et le droit d'obtenir un emploi. Nul ne peut être lésé, dans son travail ou son emploi, en raison de ses origines, de ses opinions ou de ses croyances.
</p>
</blockquote>

<p>
This right to in the <a target='_blank' rel='noopener noreferrer' class='external' href="https://www.un.org/fr/universal-declaration-human-rights/">Universal Declaration of Human Rights</a> in 1948 in its 23rd article:
</p>

<blockquote>
<ol class="org-ol">
<li>Toute personne a droit au travail, au libre choix de son travail, à des conditions équitables et satisfaisantes de travail et à la protection contre le chômage.</li>
</ol>
</blockquote>

<div id="outline-container-org077951f" class="outline-2">
<h2 id="org077951f">Links to this note</h2>
</div>
</div>
</body>
</html>
